clc;

[1 2; 3 4] + 10 -2i                                                  % 直接对矩阵进行加法运算

[1 2; 3 4].*[0.1 0.2 ; 0.3 0.4]                                     % 对两个矩阵进行逐元素相乘

[1 2; 3 4].\[20 10 ; 9 2]                                            % A .\ B = B(i, j) / A(i, j)

[1 2; 3 4].^2

exp([1 2; 3 4])

log([1 10 100])

prod([1 2; 3 4])                                                      % 矩阵每一列元素的乘积

[a, b] = min([10 20 ; 30 4])

abs([1 2 ; 3 4] - pi)

[10 20 ; 30 40] >= [40 30 ; 20 10]

find([10 20 ; 30 40] >= [40 30 ;20 10])

[a, b] = find([10 20 ; 30 40] >= [40 30 ;20 10])          % a为行号，b为列号

all([1 2 ; 3 4] > 1)

any([1 2 ; 3 4] > 1)

linspace(3, 4, 5)                                                     % linspace(a, b, n) 会生成一个包含n个元素的向量，其中第一个元素是a，最后一个元素是b

A = [1 2; 3 4]; A(: , 2)


