% 判断矩阵是否为正定矩阵, 求正定矩阵的平方根分解, 并验证计算结果

% (1) [4 1 -1; 3 2 -6; 1 -5 3]
A =  [4 1 -1; 3 2 -6; 1 -5 3];
process_matrix(A)

% (2) [4 3 1; 3 3 -5; 1 -5 3]
A = [4 3 1; 3 3 -5; 1 -5 3];
process_matrix(A)

% (3) [5 7 6 5; 7 10 8 7; 6 8 10 9; 5 7 9 10]
A = [5 7 6 5; 7 10 8 7; 6 8 10 9; 5 7 9 10];
process_matrix(A)

% (4)
n = input('请输入n的值:');
A = zeros(n, n);
A(1, 1) = 5;
A(1, 2) = 6;
for i = 2: n - 1
    A(i, i - 1) = 1;
    A(i, i) = 5;
    A(i, i + 1) = 6;
end
A(n, n - 1) = 1;
A(n, n) = 5;

process_matrix(A)
